{
  "@odata.type": "microsoft.graph.windows10CompliancePolicy",
  "displayName": "TEST: Windows Compliance Policy",
  "description": "Windows Compliance Policy",
  "scheduledActionsForRule":[{"ruleName":"PasswordRequired","scheduledActionConfigurations":[{"actionType":"block","gracePeriodHours":0,"notificationTemplateId":""}]}],
  "passwordRequired":  true,
  "passwordBlockSimple":  true,
  "passwordRequiredToUnlockFromIdle":  false,
  "passwordMinutesOfInactivityBeforeLock":  5,
  "passwordExpirationDays":  730,
  "passwordMinimumLength":  8,
  "passwordMinimumCharacterSetCount":  null,
  "passwordRequiredType":  "deviceDefault",
  "passwordPreviousPasswordBlockCount":  null,
  "requireHealthyDeviceReport":  false,
  "osMinimumVersion":  null,
  "osMaximumVersion":  null,
  "mobileOsMinimumVersion":  null,
  "mobileOsMaximumVersion":  null,
  "earlyLaunchAntiMalwareDriverEnabled":  true,
  "bitLockerEnabled":  true,
  "secureBootEnabled":  true,
  "codeIntegrityEnabled":  true,
  "storageRequireEncryption":  true,
  "activeFirewallRequired":  true,
  "defenderEnabled":  false,
  "defenderVersion":  null,
  "signatureOutOfDate":  false,
  "rtpEnabled":  true,
  "antivirusRequired":  true,
  "antiSpywareRequired":  true,
  "deviceThreatProtectionEnabled":  true,
  "deviceThreatProtectionRequiredSecurityLevel":  "low",
  "configurationManagerComplianceRequired":  false,
  "tpmRequired":  false,
  "deviceCompliancePolicyScript":  null
}
