{
    "@odata.type":  "#microsoft.graph.iosCompliancePolicy",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "createdDateTime":  "2021-10-06T13:28:32.7851641Z",
    "description":  "iOS compliance policy managed via InTune.",
    "lastModifiedDateTime":  "2021-10-06T13:28:32.7851641Z",
    "displayName":  "iOS Compliance Policy",
    "version":  1,
    "passcodeBlockSimple":  true,
    "passcodeExpirationDays":  65535,
    "passcodeMinimumLength":  6,
    "passcodeMinutesOfInactivityBeforeLock":  1,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  1,
    "passcodePreviousPasscodeBlockCount":  24,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodeRequiredType":  "numeric",
    "passcodeRequired":  true,
    "osMinimumVersion":  null,
    "osMaximumVersion":  null,
    "osMinimumBuildVersion":  null,
    "osMaximumBuildVersion":  null,
    "securityBlockJailbrokenDevices":  true,
    "deviceThreatProtectionEnabled":  false,
    "deviceThreatProtectionRequiredSecurityLevel":  "medium",
    "advancedThreatProtectionRequiredSecurityLevel":  "unavailable",
    "managedEmailProfileRequired":  false,
    "restrictedApps":  [

                       ]
}
